fix: update readme architecture diagram
